[

	{
		"title":"Barbarian",
		"enum":"Barbarian",
		"description":"For some, there is only rage. In the ways of their people, in the fury of their passion, in the howl of battle, conflict is all these brutal souls know. Savages, hired muscle, masters of vicious martial techniques, they are not soldiers or professional warriors—they are the battle possessed, creatures of slaughter and spirits of war. Known as barbarians, these warmongers know little of training, preparation, or the rules of warfare; for them, only the moment exists, with the foes that stand before them and the knowledge that the next moment might hold their death. They possess a sixth sense in regard to danger and the endurance to weather all that might entail. These brutal warriors might rise from all walks of life, both civilized and savage, though whole societies embracing such philosophies roam the wild places of the world. Within barbarians storms the primal spirit of battle, and woe to those who face their rage.",
		"role":"Barbarians excel in combat, possessing the martial prowess and fortitude to take on foes seemingly far superior to themselves. With rage granting them boldness and daring beyond that of most other warriors, barbarians charge furiously into battle and ruin all who would stand in their way.",
		"alignment":"Any Nonlawful",
		"hitdie":11,
		"skills":[
			"Acrobatics",
			"Climb",
			"Craft",
			"Handle Animal",
			"Intimidate",
			"Knowledge Nature",
			"Perception",
			"Ride",
			"Survival",
			"Swim"
		],
		"ranks":4,
		"chart":[
			{
				"level":1,
				"bab":"1",
				"fort":2,
				"ref":0,
				"will":0,
				"special":[
					"Fast Movement",
					"Rage"
				]
			},
			{
				"level":2,
				"bab":"2",
				"fort":3,
				"ref":0,
				"will":0,
				"special":[
					"Rage Power",
					"Uncanny Dodge",
				]
			},
			{
				"level":3,
				"bab":"3",
				"fort":3,
				"ref":1,
				"will":1,
				"special":[
					"Trap Sense"
				]
			},
			{
				"level":4,
				"bab":"4",
				"fort":4,
				"ref":1,
				"will":1,
				"special":[
					"Rage Power"
				]
			},
			{
				"level":5,
				"bab":"5",
				"fort":4,
				"ref":1,
				"will":1,
				"special":[
					"Improved Uncanny Dodge"
				]
			},
			{
				"level":6,
				"bab":"6/1",
				"fort":5,
				"ref":2,
				"will":2,
				"special":[
					"Rage Power",
					"Trap Sense"
				]
			},
			{
				"level":7,
				"bab":"7/2",
				"fort":5,
				"ref":2,
				"will":2,
				"special":[
					"Damage Reduction"
				]
			},
			{
				"level":8,
				"bab":"8/3",
				"fort":6,
				"ref":2,
				"will":2,
				"special":[
					"Rage Power"
				]
			},
			{
				"level":9,
				"bab":"9/4",
				"fort":6,
				"ref":3,
				"will":3,
				"special":[
					"Trap Sense"
				]
			},
			{
				"level":10,
				"bab":"10/5",
				"fort":7,
				"ref":3,
				"will":3,
				"special":[
					"Damage Reduction",
					"Rage Power"
				]
			},
			{
				"level":11,
				"bab":"11/6/1",
				"fort":7,
				"ref":3,
				"will":3,
				"special":[
					"Greater Rage"
				]
			},
			{
				"level":12,
				"bab":"12/7/2",
				"fort":8,
				"ref":4,
				"will":4,
				"special":[
					"Rage Power",
					"Trap Sense"
				]
			},
			{
				"level":13,
				"bab":"13/8/3",
				"fort":8,
				"ref":4,
				"will":4,
				"special":[
					"Damage Reduction"
				]
			},
			{
				"level":14,
				"bab":"14/9/4",
				"fort":9,
				"ref":4,
				"will":4,
				"special":[
					"Indomitable Will",
					"Rage Power"
				]
			},
			{
				"level":15,
				"bab":"15/10/5",
				"fort":9,
				"ref":5,
				"will":5,
				"special":[
					"Trap Sense"
				]
			},
			{
				"level":16,
				"bab":"16/11/6/1",
				"fort":10,
				"ref":5,
				"will":5,
				"special":[
					"Damage Reduction",
					"Rage Power"
				]
			},
			{
				"level":17,
				"bab":"17/12/7/2",
				"fort":10,
				"ref":5,
				"will":5,
				"special":[
					"Tireless Rage"
				]
			},
			{
				"level":18,
				"bab":"18/13/8/3",
				"fort":11,
				"ref":6,
				"will":6,
				"special":[
					"Rage Power",
					"Trap Sense"
				]
			},
			{
				"level":19,
				"bab":"19/14/9/4",
				"fort":11,
				"ref":6,
				"will":6,
				"special":[
					"Damage Reduction"
				]
			},
			{
				"level":20,
				"bab":"20/15/10/5",
				"fort":12,
				"ref":6,
				"will":6,
				"special":[
					"Mighty Rage",
					"Rage Power"
				]
			}

		],
		"features":[
			{
				"title":"Proficiency",
				"description":"A barbarian is prof icient with all simple and martial weapons, light armor, medium armor, and shields (except tower shields).",
			},
			{
				"title":"Fast Movement",
				"description":"A barbarian’s base speed is faster than the norm for her race by +10 feet. This benef it applies only when she is wearing no armor, light armor, or medium armor, and not carrying a heavy load. Apply this bonus before modifying the barbarian’s speed because of any load carried or armor worn. This bonus stacks with any other bonuses to the barbarian’s base speed.",
			},
			{
				"title":"Rage",
				"description":"A barbarian can call upon inner reserves of strength and ferocity, granting her additional combat prowess. Starting at 1st level, a barbarian can rage for a number of rounds per day equal to 4 + her Constitution modif ier. At each level after 1st, she can rage for 2 additional rounds. Temporary increases to Constitution, such as those gained from rage and spells like bear’s endurance, do not increase the total number of rounds that a barbarian can rage per day. A barbarian can enter rage as a free action. The total number of rounds of rage per day is renewed after resting for 8 hours, although these hours do not need to be consecutive.While in rage, a barbarian gains a +4 morale bonus to her Strength and Constitution, as well as a +2 morale bonus on Will saves. In addition, she takes a –2 penalty to Armor Class. The increase to Constitution grants the barbarian 2 hit points per Hit Dice, but these disappear when the rage ends and are not lost f irst like temporary hit points. While in rage, a barbarian cannot use any Charisma-, Dexterity-, or Intelligence-based skills (except Acrobatics, Fly, Intimidate, and Ride) or any ability that requires patience or concentration.A barbarian can end her rage as a free action and is fatigued after rage for a number of rounds equal to 2 times the number of rounds spent in the rage. A barbarian cannot enter a new rage while fatigued or exhausted but can otherwise enter rage multiple times during a single encounter or combat. If a barbarian falls unconscious, her rage immediately ends, placing her in peril of death."
			},
			{
				"title":"Rage Power",
				"description":"As a barbarian gains levels, she learns to use her rage in new ways. Starting at 2nd level, a barbarian gains a rage power. She gains another rage power for every two levels of barbarian attained after 2nd level. A barbarian gains the benef its of rage powers only while raging, and some of these powers require the barbarian to take an action first. Unless otherwise noted, a barbarian cannot select an individual power more than once."
			},
			{
				"title":"Uncanny Dodge",
				"description":"At 2nd level, a barbarian gains the ability to react to danger before her senses would normally allow her to do so. She cannot be caught f lat-footed, nor does she lose her Dex bonus to AC if the attacker is invisible. She still loses her Dexterity bonus to AC if immobilized. A barbarian with this ability can still lose her Dexterity bonus to AC if an opponent successfully uses the feint action against her.If a barbarian already has uncanny dodge from a different class, she automatically gains improved uncanny dodge (see below) instead."
			},
			{
				"title":"Trap Sense",
				"description":"At 3rd level, a barbarian gains a +1 bonus on Reflex saves made to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses increase by +1 every three barbarian levels thereafter (6th, 9th, 12th, 15th, and 18th level). Trap sense bonuses gained from multiple classes stack."
			},
			{
				"title":"Improved Uncanny Dodge",
				"description":"At 5th level and higher, a barbarian can no longer be flanked. This defense denies a rogue the ability to sneak attack the barbarian by f lanking her, unless the attacker has at least four more rogue levels than the target has barbarian levels.If a character already has uncanny dodge (see above) from another class, the levels from the classes that grant uncanny dodge stack to determine the minimum rogue level required to f lank the character."
			},
			{
				"title":"Damage Reduction",
				"description":"At 7th level, a barbarian gains damage reduction. Subtract 1 from the damage the barbarian takes each time she is dealt damage from a weapon or a natural attack. At 10th level, and every three barbarian levels thereafter (13th, 16th, and 19th level), this damage reduction rises by 1 point. Damage reduction can reduce damage to 0 but not below 0."
			},
			{
				"title":"Greater Rage",
				"description":" At 11th level, when a barbarian enters rage, the morale bonus to her Strength and Constitution increases to +6 and the morale bonus on her Will saves increases to +3."
			},
			{
				"title":"Indomitable Will",
				"description":"While in rage, a barbarian of 14th level or higher gains a +4 bonus on Will saves to resist enchantment spells. This bonus stacks with all other modif iers, including the morale bonus on Will saves she also receives during her rage."
			},
			{
				"title":"Tireless Rage",
				"description":"Starting at 17th level, a barbarian no longer becomes fatigued at the end of her rage."
			},
			{
				"title":"Mighty Rage",
				"description":"At 20th level, when a barbarian enters rage, the morale bonus to her Strength and Constitution increases to +8 and the morale bonus on her Will saves increases to +4."
			}
		],
		"ex-class":"A barbarian who becomes lawful loses the ability to rage and cannot gain more levels in barbarian. She retains all other benef its of the class."

	},
	{
		"title":"Bard",
		"enum":"Bard",
		"description":"Untold wonders and secrets exist for those skillful enough to discover them. Through cleverness, talent, and magic, these cunning few unravel the wiles of the world, becoming adept in the arts of persuasion, manipulation, and inspiration. Typically masters of one or many forms of artistry, bards possess an uncanny ability to know more than they should and use what they learn to keep themselves and their allies ever one step ahead of danger. Bards are quick-witted and captivating, and their skills might lead them down many paths, be they gamblers or jacks-of-all-trades, scholars or performers, leaders or scoundrels, or even all of the above. For bards, every day brings its own opportunities, adventures, and challenges, and only by bucking the odds, knowing the most, and being the best might they claim the treasures of each.",
		"role":"Bards capably confuse and confound their foes while inspiring their allies to ever-greater daring. While accomplished with both weapons and magic, the true strength of bards lies outside melee, where they can support their companions and undermine their foes without fear of interruptions to their performances.",
		"alignment":"Any",
		"hitdie":8,
		"skills":[
			"Acrobatics",
			"Appraise",
			"Bluff",
			"Climb",
			"Craft",
			"Diplomacy",
			"Disguise",
			"Escape Artist",
			"Intimidate",
			"Knowledge Arcana",
			"Knowledge Dungeoneering",
			"Knowledge Engineering",
			"Knowledge Geography",
			"Knowledge History",
			"Knowledge Local",
			"Knowledge Nature",
			"Knowledge Nobility",
			"Knowledge Planes",
			"Knowledge Religion",
			"Linguistics",
			"Perception",
			"Perform",
			"Profession",
			"Sense Motive",
			"Sleight of Hand",
			"Spellcraft",
			"Stealth",
			"Use Magic Device"

		],
		"ranks":6,
		"chart":[
			{
				"level":1,
				"bab":"0",
				"fort":0,
				"ref":2,
				"will":2,
				"special":[
					"Bardic Knowledge",
					"Bardic Performance",
					"Cantrips",
					"Countersong",
					"Distraction",
					"Facinate",
					"Inspire Courage"
				]
			},
			{
				"level":2,
				"bab":"1",
				"fort":0,
				"ref":3,
				"will":3,
				"special":[
					"Versatile Performance",
					"Well-Versed"
				]
			},
			{
				"level":3,
				"bab":"2",
				"fort":1,
				"ref":3,
				"will":3,
				"special":[
					"Inspire Competence"
				]
			},
			{
				"level":4,
				"bab":"3",
				"fort":1,
				"ref":4,
				"will":4,
				"special":[
				]
			},
			{
				"level":5,
				"bab":"3",
				"fort":1,
				"ref":4,
				"will":4,
				"special":[
					"Inspire Courage",
					"Lore Master"
				]
			},
			{
				"level":6,
				"bab":"4",
				"fort":2,
				"ref":5,
				"will":5,
				"special":[
					"Suggestion",
					"Versatile Performance"
				]
			},
			{
				"level":7,
				"bab":"5",
				"fort":2,
				"ref":5,
				"will":5,
				"special":[
					"Inspire Competence"
				]
			},
			{
				"level":8,
				"bab":"6/1",
				"fort":2,
				"ref":6,
				"will":6,
				"special":[
					"Dirge of Doom"
				]
			},
			{
				"level":9,
				"bab":"6/1",
				"fort":3,
				"ref":6,
				"will":6,
				"special":[
					"Inspire Greatness"
				]
			},
			{
				"level":10,
				"bab":"7/2",
				"fort":3,
				"ref":7,
				"will":7,
				"special":[
					"Jacks-of-all-Trades",
					"Versatile Performance"
				]
			},
			{
				"level":11,
				"bab":"8/3",
				"fort":3,
				"ref":7,
				"will":7,
				"special":[
					"Inspire Competence",
					"Inspire Courage",
					"Lore Master"
				]
			},
			{
				"level":12,
				"bab":"9/4",
				"fort":4,
				"ref":8,
				"will":8,
				"special":[
					"Soothing Performance"
				]
			},
			{
				"level":13,
				"bab":"9/4",
				"fort":4,
				"ref":8,
				"will":8,
				"special":[
				]
			},
			{
				"level":14,
				"bab":"10/5",
				"fort":4,
				"ref":9,
				"will":9,
				"special":[
					"Frightening Tune",
					"Versatile Performance"
				]
			},
			{
				"level":15,
				"bab":"11/6/1",
				"fort":5,
				"ref":9,
				"will":9,
				"special":[
					"Inspire Competence",
					"Inspire Heroics"
				]
			},
			{
				"level":16,
				"bab":"12/7/2",
				"fort":5,
				"ref":10,
				"will":10,
				"special":[
				]
			},
			{
				"level":17,
				"bab":"12/7/2",
				"fort":5,
				"ref":10,
				"will":10,
				"special":[
					"Inspire Courage",
					"Lore Master"
				]
			},
			{
				"level":18,
				"bab":"13/8/3",
				"fort":6,
				"ref":11,
				"will":11,
				"special":[
					"Mass Suggestion",
					"Versatile Performance"
				]
			},
			{
				"level":19,
				"bab":"14/9/4",
				"fort":6,
				"ref":11,
				"will":11,
				"special":[
					"Inspire Competence"
				]
			},
			{
				"level":20,
				"bab":"15/10/5",
				"fort":6,
				"ref":12,
				"will":12,
				"special":[
					"Deadly Performance"
				]
			}

		],
		"features":[
			{
				"title":"Proficiency",
				"description":"A bard is prof icient with all simple weapons, plus the longsword, rapier, sap, short sword, shortbow, and whip. Bards are also prof icient with light armor and shields (except tower shields). A bard can cast bard spells while wearing light armor and use a shield without incurring the normal arcane spell failure chance. Like any other arcane spellcaster, a bard wearing medium or heavy armor incurs a chance of arcane spell failure if the spell in question has a somatic component. A multiclass bard still incurs the normal arcane spell failure chance for arcane spells received from other classes.",
			},
			{
				"title":"Spells",
				"description":"A bard casts arcane spells drawn from the bard spell list presented in Chapter 10. He can cast any spell he knows without preparing it ahead of time. Every bard spell has a verbal component (song, recitation, or music). To learn or cast a spell, a bard must have a Charisma score equal to at least 10 + the spell level. The Diff iculty Class for a saving throw against a bard’s spell is 10 + the spell level + the bard’s Charisma modif ier.Like other spellcasters, a bard can cast only a certain number of spells of each spell level per day. His base daily spell allotment is given on Table 3–3. In addition, he receives bonus spells per day if he has a high Charisma score (see Table 1–3).The bard’s selection of spells is extremely limited. A bard begins play knowing four 0-level spells and two 1st-level spells of the bard’s choice. At each new bard level, he gains one or more new spells, as indicated on Table 3–4. (Unlike spells per day, the number of spells a bard knows is not affected by his Charisma score. The numbers on Table 3–4 are f ixed.)Upon reaching 5th level, and at every third bard level after that (8th, 11th, and so on), a bard can choose to learn a new spell in place of one he already knows. In effect, the bard “loses” the old spell in exchange for the new one. The new spell’s level must be the same as that of the spell being exchanged, and it must be at least one level lower than the highest-level bard spell the bard can cast. A bard may swap only a single spell at any given level and must choose whether or not to swap the spell at the same time that he gains new spells known for the level.A bard need not prepare his spells in advance. He can cast any spell he knows at any time, assuming he has not yet used up his allotment of spells per day for the spell’s level.",
			},
			{
				"title":"Bardic Knowledge",
				"description":"A bard adds half his class level (minimum 1) on all Knowledge skill checks and may make all Knowledge skill checks untrained."
			},
			{
				"title":"Bardic Performance",
				"description":"A bard is trained to use the Perform skill to create magical effects on those around him, including himself if desired. He can use this ability for a number of rounds per day equal to 4 + his Charisma modifier. At each level after 1st a bard can use bardic performance for 2 additional rounds per day. Each round, the bard can produce any one of the types of bardic performance that he has mastered, as indicated by his level. 
				Starting a bardic performance is a standard action, but it can be maintained each round as a free action. Changing a bardic performance from one effect to another requires the bard to stop the previous performance and start a new one as a standard action. A bardic performance cannot be disrupted, but it ends immediately if the bard is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. A bard cannot have more than one bardic performance in effect at one time.
				At 7th level, a bard can start a bardic performance as a move action instead of a standard action. At 13th level, a bard can start a bardic performance as a swift action. Each bardic performance has audible components, visual components, or both.If a bardic performance has audible components, the targets must be able to hear the bard for the performance to have any effect, and many such performances are language dependent (as noted in the description). A deaf bard has a 20% chance to fail when attempting to use a bardic performance with an audible component. If he fails this check, the attempt still counts against his daily limit. Deaf creatures are immune to bardic performances with audible components.If a bardic performance has a visual component, the targets must have line of sight to the bard for the performance to have any effect. A blind bard has a 50% chance to fail when attempting to use a bardic performance with a visual component. If he fails this check, the attempt still counts against his daily limit. Blind creatures are immune to bardic performances with visual components."
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			},
			{
				"title":"",
				"description":""
			}
		],
		"ex-class":""

	}

]